alpha_1.55/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
26254
(
( 1.550913839e-05 -5.439070264e-06 6.192489366e-08 1.051436811e-05 1.808350305e-07 1.160251486e-05 )
( 1.635868102e-05 -5.395937023e-06 6.819644938e-08 1.178042658e-05 1.360075714e-07 1.237938432e-05 )
( 1.48391382e-05 -5.417445209e-06 7.821363113e-08 9.631219655e-06 1.223277621e-07 1.126961524e-05 )
( 2.035060606e-05 -6.333726105e-06 1.371212903e-07 1.542696009e-05 1.10372369e-07 1.478879312e-05 )
( 1.59056508e-05 -5.062690889e-06 6.26336174e-08 1.156646704e-05 5.542812431e-08 1.243239331e-05 )
( 1.496090408e-05 -5.169094038e-06 7.233511212e-08 1.022527704e-05 5.416478288e-08 1.165642061e-05 )
( 1.380259891e-05 -5.397811492e-06 1.196352457e-07 8.295126463e-06 1.954561846e-08 1.07947144e-05 )
( 1.381247876e-05 -5.665431672e-06 1.416639179e-07 7.777733117e-06 6.779131922e-08 1.05664376e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
