alpha_1.55/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
26254
(
( -0.002745959908 0.00190878252 3.438244312e-05 )
( -0.002573177684 0.00187521358 3.02412609e-05 )
( -0.002667140914 0.001823121449 2.799929644e-05 )
( -0.001870542765 0.001709713484 3.62438368e-05 )
( -0.002528119367 0.001830020221 1.750178672e-05 )
( -0.002596159 0.00181028957 2.113436676e-05 )
( -0.002497800859 0.00167227909 2.091938586e-05 )
( -0.002467165235 0.001628164551 2.392500937e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
